       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
      *    This program will just print Hello to the screen
      /    2 style of whole-line comments
       ENVIRONMENT DIVISION.
       
       DATA DIVISION. *> End line comment
       
       PROCEDURE DIVISION.
       000-MAIN-PROCEDURE.
           DISPLAY "Hello, world!".
           STOP RUN.
