       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       
       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       
       PROCEDURE DIVISION.
       000-MAIN-PROCEDURE.
           DISPLAY "Hello, world!".
           STOP RUN.
